#!/bin/bash
echo "[1/3] Запуск статического анализа кода Semgrep SAST..."
echo "[2/3] Проверка на наличие уязвимостей уровня ERROR..."

semgrep scan --config auto --severity ERROR app/
SCAN_STATUS=$?

echo "[3/3] Проверка кода завершения анализатора..."
if [ $SCAN_STATUS -ne 0 ]; then
    echo "=================================================================="
    echo "[FAIL] QUALITY GATE FAILED: Обнаружены критические уязвимости!"
    echo "Сборка остановлена. Исправьте дефекты безопасности."
    echo "=================================================================="
    exit 1
else
    echo "=================================================================="
    echo "[+] QUALITY GATE PASSED: Критические уязвимости не обнаружены!"
    echo "Сборка проекта и деплой разрешены."
    echo "=================================================================="
    exit 0
fi
